[
    {
        "title": "Design and Implementation of Privacy-Preserving, Flexible and Scalable Role-based Hierarchical Access Control",
        "authors": "T. Phillips, X. Yu, B. Haakenson and X. Zou",
        "published": "IEEE Conference on Trust, Privacy and Security in Intelligent Systems, and Applications(TPS ’19)",
        "abstract": "In many domains, organizations must model personnel and corresponding data access privileges as fine-grained hierarchical access control models. One class of such models, Role-based Access Control (RBAC) models, has been widely accepted and deployed. However, RBAC models are often used without involving cryptographic keys nor considering confidentiality/privacy at the data level. How to design, implement and dynamically modify such a hierarchy, ensure user and data privacy and distribute and manage necessary cryptographic keys are issues of the utmost importance. One elegant solution for cryptography-based hierarchical access control combines the collusion-resistant and privacy-preserving Access Control Polynomial (ACP) and Atallah's Dynamic and Efficient Extended Key Management scheme. Such a model involves cryptographic keys used to encrypt data, can address confidentiality/privacy at the data level and can efficiently support dynamic changes to the RBAC access hierarchy. In this paper, we discuss several implementation challenges and propose solutions when deploying such a system including: data encryption and decryption, key storage and key distribution. Furthermore, we provide analysis of the efficiency and scalability of the resulting system.",
        "link": "https://ieeexplore.ieee.org/document/9014351"
    },
    {
        "title": "User-Friendly Design of Cryptographically-Enforced Hierarchical Role-based Access Control Models",
        "authors": "X. Yu, B. Haakenson, T. Phillips and X. Zou",
        "published": "IEEE Conference on Computer Communications and Networks(ICCCN ’20)",
        "abstract": "Data access control is a critical issue for any organization generating, recording or leveraging sensitive information. The popular Role-based Access Control (RBAC) model is well-suited for large organizations with various groups of personnel, each needing their own set of data access privileges. Unfortunately, the traditional RBAC model does not involve the use of cryptographic keys needed to enforce access control policies and protect data privacy. Cryptography-based Hierarchical Access Control (CHAC) models, on the other hand, have been proposed to facilitate RBAC models and directly enforce data privacy and access controls through the use of key management schemes. Though CHAC models and efficient key management schemes can support large and dynamic organizations, they are difficult to design and maintain without intimate knowledge of symmetric encryption, key management and hierarchical access control models. Therefore, in this paper we propose an efficient algorithm which automatically generates a fine-grained CHAC model based on the input of a highly user-friendly representation of access control policies. The generated CHAC model, the dual-level key management (DLKM) scheme, leverages the collusion-resistant Access Control Polynomial (ACP) and Atallah’s Efficient Key Management scheme in order to provide privacy at both the data and user levels. As a result, the proposed model generation algorithm serves to democratize the use of CHAC. We analyze each component of our proposed system and evaluate the resulting performance of the user-friendly CHAC model generation algorithm, as well as the DLKM model itself, along several dimensions.",
        "link": "https://ieeexplore.ieee.org/document/9209656"
    },
    {
        "title": "AuthN-AuthZ: Integrated, User-Friendly and Privacy-Preserving Authentication and Authorization",
        "authors": "T. Phillips, X. Yu, B. Haakenson, S. Goyal, X. Zou, S. Purkayastha, H. Wu",
        "published": "IEEE International Conference on Trust, Privacy and Security in Intelligent Systems and Applications (TPS-ISA)",
        "abstract": "In this paper, we propose a novel, privacy-preserving, and integrated authentication and authorization scheme (dubbed as AuthN-AuthZ). The proposed scheme can address both the usability and privacy issues often posed by authentication through use of privacy-preserving Biometric-Capsule-based authentication. Each Biometric-Capsule encapsulates a user’s biometric template as well as their role within a hierarchical Role-based Access Control model. As a result, AuthN-AuthZ provides novel efficiency by performing both authentication and authorization simultaneously in a single operation. To the best of our knowledge, our scheme’s integrated AuthN-AuthZ operation is the first of its kind. The proposed scheme is flexible in design and allows for the secure use of robust deep learning techniques, such as the recently proposed and current state-of-the-art facial feature representation method, ArcFace. We conduct extensive experiments to demonstrate the robust performance of the proposed scheme and its AuthN-AuthZ operation.",
        "link": "https://ieeexplore.ieee.org/abstract/document/9325396"
    }

]